In [ ]:
#Assignment 2 - Working with Pandas

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\kritish dhiman\.conda\envs\medibot\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.22.4 in c:\users\kritish dhiman\.conda\envs\medibot\lib\site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\kritish dhiman\.conda\envs\medibot\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\kritish dhiman\.conda\envs\medibot\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\kritish dhiman\.conda\envs\medibot\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\kritish dhiman\.conda\envs\medibot\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
import numpy as np
import pandas as pd
data = {
      'Name': ['Alice', 'Bob', 'Charlie', 'Diana', 'Eve'],
      'Age': [24, 27, 22, 32, 29],
      'Department': ['HR', 'Finance', 'IT', 'Marketing', 'HR'],
      'Salary': [45000, 54000, 50000, 62000, 47000]
  }

In [10]:
data_frame = pd.DataFrame(data)
data_frame.head(5)

      Name  Age Department  Salary
0    Alice   24         HR   45000
1      Bob   27    Finance   54000
2  Charlie   22         IT   50000
3    Diana   32  Marketing   62000
4      Eve   29         HR   47000

In [14]:
data_frame[["Age", "Salary"]].describe()

             Age        Salary
count   5.000000      5.000000
mean   26.800000  51600.000000
std     3.962323   6730.527468
min    22.000000  45000.000000
25%    24.000000  47000.000000
50%    27.000000  50000.000000
75%    29.000000  54000.000000
max    32.000000  62000.000000

In [21]:
Average_salary_of_HR = data_frame[data_frame['Department']== 'HR']['Salary'].mean()
Average_salary_of_HR

np.float64(46000.0)

In [25]:
data_frame['Bonus'] = data_frame['Salary']*0.10
data_frame.head()

      Name  Age Department  Salary   Bonus
0    Alice   24         HR   45000  4500.0
1      Bob   27    Finance   54000  5400.0
2  Charlie   22         IT   50000  5000.0
3    Diana   32  Marketing   62000  6200.0
4      Eve   29         HR   47000  4700.0

In [29]:
filtered_data_frame = data_frame[(data_frame['Age'] >25) & (data_frame['Age'] <30)]
filtered_data_frame

  Name  Age Department  Salary   Bonus
1  Bob   27    Finance   54000  5400.0
4  Eve   29         HR   47000  4700.0

In [36]:
grouped_data = data_frame.groupby('Department')['Salary'].mean()
grouped_data

Department
Finance    54000.0
HR         47000.0
Name: Salary, dtype: float64

In [38]:
asc_ord_salary = data_frame.sort_values(by='Salary',ascending=True)
asc_ord_salary.to_csv('sorted_salary.csv', index=False)
asc_ord_salary

  Name  Age Department  Salary   Bonus
4  Eve   29         HR   47000  4700.0
1  Bob   27    Finance   54000  5400.0